In [1]:
import sqlite3

In [2]:
# Connecting to database
connection = sqlite3.connect('example.db')
connection

In [3]:
cursor = connection.cursor()

In [4]:
# Creating table
cursor.execute('''
        Create Table if Not Exists employee(
            id Integer Primary Key, 
            name Text Not Null,
            age Integer,
            department Text
        )
    ''')

# commit the changes
connection.commit()

In [5]:
cursor.execute('''
        Select * From employee
    ''')

In [6]:
# Inserting data
cursor.execute('''
        Insert Into employee Values
            (1, 'Anoop George', 22, "Data Scientist"),
            (2, 'Krish Naik', 35, "Data Scientist Tutor"),
            (3, "Jesus Christ", 2024, "God")
    ''')

connection.commit()

In [7]:
cursor.execute('''
        Insert Into employee Values
            (4, 'Anoop George', 22, "Data Scientist")
    ''')

cursor.execute('''
        Insert Into employee Values
            (5, 'Anoop George', 22, "Data Scientist")
    ''')

cursor.execute('''
        Insert Into employee Values
            (6, 'Anoop George', 22, "Data Scientist")
    ''')


connection.commit()

In [8]:
cursor.execute('''
        Select * From employee
    ''')
rows = cursor.fetchall()
rows

[(1, 'Anoop George', 22, 'Data Scientist'),
 (2, 'Krish Naik', 35, 'Data Scientist Tutor'),
 (3, 'Jesus Christ', 2024, 'God'),
 (4, 'Anoop George', 22, 'Data Scientist'),
 (5, 'Anoop George', 22, 'Data Scientist'),
 (6, 'Anoop George', 22, 'Data Scientist')]

In [9]:
# Updating data
cursor.execute('''
        Update employee
        Set age = 34
        Where name = "Krish Naik"           
    ''')

connection.commit()

In [10]:
cursor.execute('''
        Select * From employee
    ''')
rows = cursor.fetchall()
rows

[(1, 'Anoop George', 22, 'Data Scientist'),
 (2, 'Krish Naik', 34, 'Data Scientist Tutor'),
 (3, 'Jesus Christ', 2024, 'God'),
 (4, 'Anoop George', 22, 'Data Scientist'),
 (5, 'Anoop George', 22, 'Data Scientist'),
 (6, 'Anoop George', 22, 'Data Scientist')]

In [11]:
# Delete data
cursor.execute('''
        Delete From employee
        Where id = 6           
    ''')

connection.commit()

In [12]:
cursor.execute('''
        Select * From employee
    ''')
rows = cursor.fetchall()
rows

[(1, 'Anoop George', 22, 'Data Scientist'),
 (2, 'Krish Naik', 34, 'Data Scientist Tutor'),
 (3, 'Jesus Christ', 2024, 'God'),
 (4, 'Anoop George', 22, 'Data Scientist'),
 (5, 'Anoop George', 22, 'Data Scientist')]

In [13]:
connection.close()